loadtest/rep100/statistics.json
{
  "1 - Login" : {
    "transaction" : "1 - Login",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 257.90999999999997,
    "medianResTime" : 254.0,
    "minResTime" : 247.0,
    "maxResTime" : 294.0,
    "pct1ResTime" : 274.6,
    "pct2ResTime" : 285.95,
    "pct3ResTime" : 294.0,
    "throughput" : 1.680870018321483,
    "receivedKBytesPerSec" : 2.791655898593112,
    "sentKBytesPerSec" : 0.387256694064848
  },
  "3 - Iniciar PRE_TEST" : {
    "transaction" : "3 - Iniciar PRE_TEST",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.629999999999999,
    "medianResTime" : 5.0,
    "minResTime" : 3.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 6.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 6.989999999999995,
    "throughput" : 1.6894745734076702,
    "receivedKBytesPerSec" : 1.349368822858591,
    "sentKBytesPerSec" : 1.2160092234752493
  },
  "4 - Enviar respuesta" : {
    "transaction" : "4 - Enviar respuesta",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.688,
    "medianResTime" : 6.0,
    "minResTime" : 3.0,
    "maxResTime" : 22.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 8.990000000000009,
    "throughput" : 12.655344351919815,
    "receivedKBytesPerSec" : 9.388424057651422,
    "sentKBytesPerSec" : 9.402896136006985
  },
  "5 - Completar" : {
    "transaction" : "5 - Completar",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 14.089999999999998,
    "medianResTime" : 14.0,
    "minResTime" : 12.0,
    "maxResTime" : 30.0,
    "pct1ResTime" : 15.0,
    "pct2ResTime" : 16.94999999999999,
    "pct3ResTime" : 29.889999999999944,
    "throughput" : 1.6369827134625459,
    "receivedKBytesPerSec" : 1.903344099905055,
    "sentKBytesPerSec" : 1.1398611173634756
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1400,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 24.285000000000014,
    "medianResTime" : 6.0,
    "minResTime" : 3.0,
    "maxResTime" : 294.0,
    "pct1ResTime" : 14.0,
    "pct2ResTime" : 252.0,
    "pct3ResTime" : 266.99,
    "throughput" : 17.214243556954557,
    "receivedKBytesPerSec" : 19.659804472321955,
    "sentKBytesPerSec" : 12.004473301784133
  },
  "2 - Entregar cuestionario" : {
    "transaction" : "2 - Entregar cuestionario",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.480000000000002,
    "medianResTime" : 6.0,
    "minResTime" : 5.0,
    "maxResTime" : 8.0,
    "pct1ResTime" : 8.0,
    "pct2ResTime" : 8.0,
    "pct3ResTime" : 8.0,
    "throughput" : 1.6893318692457133,
    "receivedKBytesPerSec" : 8.359041752892981,
    "sentKBytesPerSec" : 1.1598154140974744
  }
}