loadtest/rep200/statistics.json
{
  "1 - Login" : {
    "transaction" : "1 - Login",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 264.075,
    "medianResTime" : 260.0,
    "minResTime" : 246.0,
    "maxResTime" : 339.0,
    "pct1ResTime" : 287.0,
    "pct2ResTime" : 293.95,
    "pct3ResTime" : 298.99,
    "throughput" : 3.3492422339445698,
    "receivedKBytesPerSec" : 5.562587655949091,
    "sentKBytesPerSec" : 0.7716340115548856
  },
  "3 - Iniciar PRE_TEST" : {
    "transaction" : "3 - Iniciar PRE_TEST",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.549999999999999,
    "medianResTime" : 4.0,
    "minResTime" : 3.0,
    "maxResTime" : 13.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 7.0,
    "throughput" : 3.3695560609889648,
    "receivedKBytesPerSec" : 2.6911367513267628,
    "sentKBytesPerSec" : 2.4252577183893522
  },
  "4 - Enviar respuesta" : {
    "transaction" : "4 - Enviar respuesta",
    "sampleCount" : 2000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.465,
    "medianResTime" : 5.0,
    "minResTime" : 4.0,
    "maxResTime" : 30.0,
    "pct1ResTime" : 6.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 8.0,
    "throughput" : 25.0,
    "receivedKBytesPerSec" : 18.547412109375,
    "sentKBytesPerSec" : 18.574951171875
  },
  "5 - Completar" : {
    "transaction" : "5 - Completar",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 15.495000000000001,
    "medianResTime" : 15.0,
    "minResTime" : 12.0,
    "maxResTime" : 28.0,
    "pct1ResTime" : 17.0,
    "pct2ResTime" : 18.0,
    "pct3ResTime" : 20.99000000000001,
    "throughput" : 3.0803351404632826,
    "receivedKBytesPerSec" : 3.581611554337112,
    "sentKBytesPerSec" : 2.144893911332553
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2800,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 24.659999999999993,
    "medianResTime" : 6.0,
    "minResTime" : 3.0,
    "maxResTime" : 339.0,
    "pct1ResTime" : 16.0,
    "pct2ResTime" : 255.0,
    "pct3ResTime" : 281.0,
    "throughput" : 33.771966855226815,
    "receivedKBytesPerSec" : 38.57093837445271,
    "sentKBytesPerSec" : 23.551117603336188
  },
  "2 - Entregar cuestionario" : {
    "transaction" : "2 - Entregar cuestionario",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.469999999999998,
    "medianResTime" : 6.0,
    "minResTime" : 5.0,
    "maxResTime" : 10.0,
    "pct1ResTime" : 7.900000000000006,
    "pct2ResTime" : 8.0,
    "pct3ResTime" : 9.0,
    "throughput" : 3.369328998130022,
    "receivedKBytesPerSec" : 16.672042018691354,
    "sentKBytesPerSec" : 2.313222036675146
  }
}