loadtest/rep250/statistics.json
{
  "1 - Login" : {
    "transaction" : "1 - Login",
    "sampleCount" : 250,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 294.5919999999999,
    "medianResTime" : 287.0,
    "minResTime" : 260.0,
    "maxResTime" : 965.0,
    "pct1ResTime" : 298.0,
    "pct2ResTime" : 302.9,
    "pct3ResTime" : 834.6200000000022,
    "throughput" : 4.190271864838591,
    "receivedKBytesPerSec" : 6.957962799813952,
    "sentKBytesPerSec" : 0.9653175126127184
  },
  "3 - Iniciar PRE_TEST" : {
    "transaction" : "3 - Iniciar PRE_TEST",
    "sampleCount" : 250,
    "errorCount" : 1,
    "errorPct" : 0.4,
    "meanResTime" : 6.440000000000003,
    "medianResTime" : 5.0,
    "minResTime" : 4.0,
    "maxResTime" : 35.0,
    "pct1ResTime" : 10.900000000000006,
    "pct2ResTime" : 13.0,
    "pct3ResTime" : 35.0,
    "throughput" : 4.270292429625581,
    "receivedKBytesPerSec" : 3.4053413618389587,
    "sentKBytesPerSec" : 3.0727589772222603
  },
  "4 - Enviar respuesta" : {
    "transaction" : "4 - Enviar respuesta",
    "sampleCount" : 2500,
    "errorCount" : 10,
    "errorPct" : 0.4,
    "meanResTime" : 5.823199999999997,
    "medianResTime" : 6.0,
    "minResTime" : 4.0,
    "maxResTime" : 30.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 8.0,
    "pct3ResTime" : 12.0,
    "throughput" : 31.09414062014154,
    "receivedKBytesPerSec" : 23.02670510550242,
    "sentKBytesPerSec" : 23.08339118139078
  },
  "5 - Completar" : {
    "transaction" : "5 - Completar",
    "sampleCount" : 250,
    "errorCount" : 1,
    "errorPct" : 0.4,
    "meanResTime" : 14.799999999999994,
    "medianResTime" : 14.0,
    "minResTime" : 7.0,
    "maxResTime" : 51.0,
    "pct1ResTime" : 16.0,
    "pct2ResTime" : 18.0,
    "pct3ResTime" : 24.980000000000018,
    "throughput" : 3.9113224963624704,
    "receivedKBytesPerSec" : 4.533772803010153,
    "sentKBytesPerSec" : 2.7210734477916674
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 3500,
    "errorCount" : 12,
    "errorPct" : 0.34285715,
    "meanResTime" : 27.406571428571322,
    "medianResTime" : 6.0,
    "minResTime" : 4.0,
    "maxResTime" : 965.0,
    "pct1ResTime" : 15.0,
    "pct2ResTime" : 282.0,
    "pct3ResTime" : 296.9899999999998,
    "throughput" : 42.352884231416155,
    "receivedKBytesPerSec" : 48.314608095905086,
    "sentKBytesPerSec" : 29.513011789227846
  },
  "2 - Entregar cuestionario" : {
    "transaction" : "2 - Entregar cuestionario",
    "sampleCount" : 250,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9.627999999999998,
    "medianResTime" : 7.0,
    "minResTime" : 5.0,
    "maxResTime" : 121.0,
    "pct1ResTime" : 10.900000000000006,
    "pct2ResTime" : 15.0,
    "pct3ResTime" : 121.0,
    "throughput" : 4.261629988237901,
    "receivedKBytesPerSec" : 21.0870112975811,
    "sentKBytesPerSec" : 2.925026342200365
  }
}